day04/01introToFVM/101FVM/nonorthoCavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;	//This is an scaling operation. Done at the end.

xmin 0;
xmax 1;
ymin 0.5;
ymax 1;
zmin 0;
zmax 1;

ymin2 0;
ymax2 0.5;

xcells 40;
ycells 20;
zcells 1;

//deltax 0.00775;	//As in Ghia et al 129 x 129 cells
//deltax 0.05;
//lx #calc "$xmax-$xmin";
//xcells #calc "round($lx/$deltax)";

//ycells $xcells;

vertices
(
//BLOCK1
    ($xmin  $ymin  $zmin)	//0
    ($xmax  $ymin  $zmin)	//1
    ($xmax  $ymax  $zmin)	//2
    ($xmin  $ymax  $zmin)	//3
    ($xmin  $ymin  $zmax)	//4
    ($xmax  $ymin  $zmax)	//5
    ($xmax  $ymax  $zmax)	//6
    ($xmin  $ymax  $zmax)	//7

//BLOCK2
    ($xmin  $ymin2  $zmin)	//8
    ($xmax  $ymin2  $zmin)	//9
    ($xmax  $ymax2  $zmin)	//10
    ($xmin  $ymax2  $zmin)	//11
    ($xmin  $ymin2  $zmax)	//12
    ($xmax  $ymin2  $zmax)	//13
    ($xmax  $ymax2  $zmax)	//14
    ($xmin  $ymax2  $zmax)	//15
/*
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
*/
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) ($xcells $ycells $zcells) simpleGrading (1 8 1)
);

edges
(
/*
    polyLine 0 1 
    (
        (0.25 0.4 0)
        (0.5 0.6 0)
        (0.75 0.4 0)
    ) 
    polyLine 4 5 
    (
        (0.25 0.4 1)
        (0.5 0.6 1)
        (0.75 0.4 1)
    ) 

    polyLine 11 10
    (
        (0.25 0.4 0)
        (0.5 0.6 0)
        (0.75 0.4 0)
    ) 
    polyLine 15 14
    (
        (0.25 0.4 1)
        (0.5 0.6 1)
        (0.75 0.4 1)
    ) 
*/

    polyLine 0 1 
    (
        (0.25 0.8 0)
        (0.6 0.25 0)
    ) 
    polyLine 4 5 
    (
        (0.25 0.8 1)
        (0.6 0.25 1)
    ) 

    polyLine 11 10
    (
        (0.25 0.8 0)
        (0.6 0.25 0)
    ) 
    polyLine 15 14
    (
        (0.25 0.8 1)
        (0.6 0.25 1)
    ) 

);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (11 15 12 8)
            (10 14 13 9)
            (8 9 13 12)
        );
    }

    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (12 15 14 13)
        );
    }
    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (8 11 10 9)
        );
    }

    interface1
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    interface2
    {
        type wall;
        faces
        (
            (11 10 14 15)
        );
    }

);

mergePatchPairs
(
    (interface1 interface2)
);

// ************************************************************************* //
