day04/01introToFVM/101FVM/nonorthoCavity/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

setFormat raw;

surlineFaceFormat foamFile;

//interpolationScheme cell;
//interpolationScheme cellPoint;
interpolationScheme cellPointFace;

// Fields to sample.
fields
(
    U
);

sets
(

    l1
    {
        type            lineCellFace;
        //type            lineCell;
        //type            lineFace;

        //type            lineUniform;
	//nPoints 	  100;

        axis            x;
        start           ( -1  0.5 0);
        end             ( 2  0.5 0);
    }

    l2
    {
        type            lineCellFace;
        //type            lineCell;
        //type            lineFace;

        axis            y;
        start           (0.5 -1 0);
        end             (0.5 2 0);
    }

);

surlineFaces
(
);

// *********************************************************************** //
